util-linux/util-linux/disk-utils/mkfs.minix.8
.\" Copyright 1992, 1993, 1994 Rickard E. Faith (faith@cs.unc.edu)
.\" May be freely distributed.
.TH MKFS.MINIX 8 "2 July 1996" "Util-linux 2.6" "Linux System Administrator's Manual"
.SH NAME
mkfs.minix \- make a Linux MINIX filesystem
.SH SYNOPSIS
.BR "mkfs.minix [ \-c | \-l filename ] [ \-n"
namelength
.B ] [ \-i
inodecount
.B ] [ \-v ]
device 
.B [ 
size-in-blocks
.B ]
.SH DESCRIPTION
.B mkfs.minix
creates a Linux MINIX file-system on a device (usually a disk partition).

The
.I device
is usually of the following form:

.nf
.RS
/dev/hda[1-8] (IDE disk 1)
/dev/hdb[1-8] (IDE disk 2)
/dev/sda[1-8] (SCSI disk 1)
/dev/sdb[1-8] (SCSI disk 2)
.RE
.fi

The
.I size-in-blocks
parameter is the desired size of the file system, in blocks.
It is present only for backwards compatibility.
If omitted the size will be determined automatically.
Only block counts strictly greater than 10 and strictly less than
65536 are allowed.
.SH OPTIONS
.TP
.B \-c
Check the device for bad blocks before creating the file system.  If any
are found, the count is printed.
.TP
.BI \-n " namelength"
Specify the maximum length of filenames.
Currently, the only allowable values are 14 and 30.
The default is 30.
.TP
.BI \-i " inodecount"
Specify the number of inodes for the filesystem.
.TP
.BI \-l " filename"
Read the bad blocks list from
.IR filename .
The file has one bad block number per line.  The count of bad blocks read
is printed.
.TP
.B \-v
Make a Minix version 2 filesystem.
.SH "EXIT CODES"
The exit code returned by
.B mkfs.minix
is one of the following:
.IP 0
No errors
.IP 8
Operational error
.IP 16
Usage or syntax error
.SH "SEE ALSO"
.BR mkfs (8),
.BR fsck (8),
.BR reboot (8)
